of/org/yjn2_rib_lower/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          42;
        startFace       25122;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          44;
        startFace       25164;
    }
    inlet
    {
        type            patch;
        nFaces          6;
        startFace       25208;
    }
    outlet
    {
        type            patch;
        nFaces          5;
        startFace       25214;
    }
    deck
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          268;
        startFace       25219;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          31236;
        startFace       25487;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       56723;
    }
)

// ************************************************************************* //
